// Подключает внешнюю компоненту NetCore из макета и возвращает её инициализированный объект.
//
// Возвращаемое значение:
//   AddIn.NetCore.NetworkAddIn - инициализированный объект внешней компоненты
//   - Неопределено - если не удалось подключить внешнюю компоненту или создать её объект
Функция ПолучитьИнициализированнуюКомпоненту() Экспорт
	ИмяМакета = "ОбщийМакет.НВК_ВК";
	ИмяСобытияЖР = "НВК_Инициализация";
	
	Попытка
		Подключено = ПодключитьВнешнююКомпоненту(ИмяМакета, "NetCore", ТипВнешнейКомпоненты.Native);	
	Исключение
		Подключено = Ложь;
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,,"Критическая ошибка при вызове ПодключитьВнешнююКомпоненту: " + ОписаниеОшибки());
	КонецПопытки;
	
	Если Не Подключено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ВК = Новый("AddIn.NetCore.NetworkAddIn");
	Исключение
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,,"Не удалось создать объект ВК Новый(""AddIn.NetCore.NetworkAddIn""). Проверьте Manifest.xml и разрядность DLL! " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ВК;
КонецФункции